html/elisp/data_type/number.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数字</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="data_type.html"> UP </a>
 |
 <a accesskey="H" href="../elisp.html"> HOME </a>
</div><div id="content">
<h1 class="title">数字</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org43d28be">整数</a></li>
<li><a href="#org1089f70">浮点数</a></li>
<li><a href="#orgd04d666">测试</a></li>
<li><a href="#org6b6e43f">比较</a></li>
<li><a href="#orgeba3701">转换</a></li>
<li><a href="#org60e6f48">运算</a></li>
</ul>
</div>
</div>
<p>
现在就先从简单的数据类型：数字开始吧。emacs 的数字分为整数和浮点数
</p>

<pre class="example">
和 C 比没有双精度数 double
</pre>

<div id="outline-container-org43d28be" class="outline-2">
<h2 id="org43d28be">整数</h2>
<div class="outline-text-2" id="text-org43d28be">
<p>
1， 1.，+1, -1, 536870913, 0, -0 这些都是整数。整数的范围是和机器是有关的，一般来最小范围是在 -268435456 to 268435455（29位，-2**28 ~ 2**28-1）
</p>

<pre class="example">
    可以从 most-positive-fixnum 和 most-negative-fixnum 两个变量得到整数的范围
</pre>

<p>
可以用多种进制来输入一个整数。比如：
</p>
<div class="org-src-container">
<pre class="src src-lisp">#b101100 <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 44      ; &#20108;&#36827;&#21046;</span>
#o54 <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 44          ; &#20843;&#36827;&#21046;</span>
#x2c <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 44          ; &#21313;&#36827;&#21046;</span>
</pre>
</div>
<p>
最神奇的是可以用 2 到 36 之间任意一个数作为基数，比如：
</p>

<div class="org-src-container">
<pre class="src src-lisp">#24r1k <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 44 &#20108;&#21313;&#22235;&#36827;&#21046;</span>
</pre>
</div>

<pre class="example">
    之所以最大是 36，是因为只有 0-9 和 a-z 36 个字符来表示数字

    但是基本上不会有人会用到 elisp 的这个特性
</pre>
</div>
</div>

<div id="outline-container-org1089f70" class="outline-2">
<h2 id="org1089f70">浮点数</h2>
<div class="outline-text-2" id="text-org1089f70">
<p>
1500.0, 15e2, 15.0e2, 1.5e3, 和 .15e4 都可以用来表示一个浮点数 1500.
</p>

<pre class="example">
    遵循 IEEE 标准，elisp 也有一个特殊类型的值称为 NaN (not-a-number)

    可以用 (/ 0.0 0.0) 产生这个数
</pre>
</div>
</div>

<div id="outline-container-orgd04d666" class="outline-2">
<h2 id="orgd04d666">测试</h2>
<div class="outline-text-2" id="text-orgd04d666">
<p>
整数类型测试函数是 integerp，浮点数类型测试函数是 floatp。数字类型测试用 numberp。可以分别运行这几个例子来试验一下：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(integerp 1.)                           <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
(integerp 1.0)                          <span style="color: #5f9ea0; font-style: italic;">; =&gt; nil</span>
(floatp 1.)                             <span style="color: #5f9ea0; font-style: italic;">; =&gt; nil</span>
(floatp -0.0e+NaN)                      <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
(numberp 1)                             <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
</pre>
</div>

<p>
还提供一些特殊测试，比如测试是否是零的 zerop，还有非负整数测试的 wholenump 
</p>

<pre class="example">
elisp 测试函数一般都是用 p 来结尾，p 是 predicate 的第一个字母

如果函数名是一个单词，通常只是在这个单词后加一个 p，如果是多个单词，一般是加 -p 
</pre>
</div>
</div>

<div id="outline-container-org6b6e43f" class="outline-2">
<h2 id="org6b6e43f">比较</h2>
<div class="outline-text-2" id="text-org6b6e43f">
<p>
常用的比较操作符号是在其它言中都很熟悉的，比如 &lt;, &gt;, &gt;=, &lt;=, = 
</p>
<pre class="example">
    由于赋值是使用 set 函数，所以 = 不再是一个赋值运算符了，而是测试数字相等符号

    和其它语言类似，对于浮点数的相等测试都是不可靠的
</pre>

<p>
比如：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq foo (- (+ 1.0 1.0e-3) 1.0))       <span style="color: #5f9ea0; font-style: italic;">; =&gt; 0.0009999999999998899</span>
(setq bar 1.0e-3)                       <span style="color: #5f9ea0; font-style: italic;">; =&gt; 0.001</span>
(= foo bar)                             <span style="color: #5f9ea0; font-style: italic;">; =&gt; nil</span>
</pre>
</div>

<p>
所以一定要确定两个浮点数是否相同，是要在一定误差内进行比较。这里给出一个函数：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #00bfff; font-weight: bold;">defvar</span> <span style="color: #4eee94;">fuzz-factor</span> 1.0e-6)

(<span style="color: #00bfff; font-weight: bold;">defun</span> <span style="color: #daa520; font-weight: bold;">approx-equal</span> (x y)
  (or (and (= x 0) (= y 0))
      (&lt; (/ (abs (- x y))
            (max (abs x) (abs y)))
         fuzz-factor)))
(approx-equal foo bar)                  <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
</pre>
</div>

<p>
还有一个测试数字是否相等的函数 eql，这是函数不仅测试数字的值是否相等，还测试 <b>数字类型</b> 是否一致，比如：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(= 1.0 1)                               <span style="color: #5f9ea0; font-style: italic;">; =&gt; t</span>
(eql 1.0 1)                             <span style="color: #5f9ea0; font-style: italic;">; =&gt; nil</span>
</pre>
</div>

<pre class="example">
elisp 没有 +=, -=, /=, *= 这样的命令式语言里常见符号

如果想实现类似功能的语句，只能用赋值函数 setq 来实现了

/= 符号被用来作为不等于的测试了 
</pre>
</div>
</div>

<div id="outline-container-orgeba3701" class="outline-2">
<h2 id="orgeba3701">转换</h2>
<div class="outline-text-2" id="text-orgeba3701">
<p>
整数向浮点数转换是通过 float 函数进行的。而浮点数转换成整数有这样几个函数：
</p>
<ul class="org-ul">
<li>truncate 转换成靠近 0 的整数</li>
<li>floor 转换成最接近的不比本身大的整数</li>
<li>ceiling 转换成最接近的不比本身小的整数</li>
<li><p>
round 四舍五入后的整数，换句话说和它的差绝对值最小的整数
</p>

<pre class="example">
      可以用 1.2, 1.7, -1.2, -1.7 对这四个函数操作一遍就知道区别了

      浮点数的范围是无穷大的，而整数是有范围的，如果用前面的函数转换 1e20 成一个整数会出现什么情况呢？
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org60e6f48" class="outline-2">
<h2 id="org60e6f48">运算</h2>
<div class="outline-text-2" id="text-org60e6f48">
<p>
四则运算没有什么好说的，就是 + - * /。值得注意的是
</p>

<pre class="example">
    和 C 语言类似，如果参数都是整数，作除法时要记住 (/ 5 6) 是会等于 0 的

    如果参数中有浮点数，整数会自动转换成浮点数进行运算，所以 (/ 5 6.0) 的值才会是 5/6
</pre>

<p>
没有++和&#x2013;操作了，类似的两个函数是 <span class="underline">1+</span> 和 <span class="underline">1-</span> 。可以用 setq 赋值来代替++和&#x2013;：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq foo 10)                           <span style="color: #5f9ea0; font-style: italic;">; =&gt; 10</span>
(setq foo (1+ foo))                     <span style="color: #5f9ea0; font-style: italic;">; =&gt; 11</span>
(setq foo (1- foo))                     <span style="color: #5f9ea0; font-style: italic;">; =&gt; 10</span>
</pre>
</div>

<pre class="example">
    可能有人看过有 incf 和 decf 两个实现 ++ 和 -- 操作，这两个宏是可以用的

    这两个宏是 Common Lisp 里的，emacs 有模拟的 Common Lisp 的库 cl。但是 RMS 认为最好不要使用这个库
</pre>

<p>
可以在的 elisp 包中使用这两个宏，只要在文件头写上：
</p>

<div class="org-src-container">
<pre class="src src-lisp">(eval-when-compile
  (<span style="color: #00bfff; font-weight: bold;">require</span> '<span style="color: #ffd700;">cl</span>))
</pre>
</div>

<pre class="example">
    由于 incf 和 decf 是两个宏，所以这样写不会在运行里导入 cl 库
</pre>

<ul class="org-ul">
<li>取数的绝对值: abs</li>
<li><p>
取整的函数: 一个是符号 %，一个是函数 mod
</p>
<pre class="example">
      这两个函数有什么差别呢？

      一是 % 的第个参数必须是整数，而 mod 的第一个参数可以是整数也可以是浮点数

      二是即使对相同的参数，两个函数也不一定有相同的返回值
</pre>

<ul class="org-ul">
<li>三角运算有函数： sin, cos, tan, asin, acos, atan</li>
<li>开方函数： sqrt</li>
<li>指数函数：exp 是以 e 为底的指数运算，expt 可以指定底数的指数运算</li>
<li>对数函数：log 默认底数是 e
<ul class="org-ul">
<li>也可以指定底数。log10 就是以10为底数</li>
<li>logb 是以 2 为底数运算，但是返回的是一个整数。这个函数是用来计算数的位</li>
</ul></li>
<li>随机函数：random 可以产生随机数</li>
</ul>

<pre class="example">
      当然还包含位运算
</pre></li>
</ul>

<p>
<a href="string.html">Next：字符串</a>
</p>

<p>
<a href="data_type.html">Top：数据类型</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
